list = [1702,1702,1702,1702,1702,1702,1702,1702,1401,1401,1104,1104,1702,1702,1208,1208,1702,1702,1702,1702,1702,1702,1702,1702,1401,1401,1702,1702,1401,1401,1001,1001,1202,1202,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1401,1401,1702,1702,1201,1201,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1208,1208,1702,1702,1702,1702,1702,1702,1401,1401,1208,1208,1208,1208,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1701,1701,1702,1702,1702,1702,1702,1702,1702,1702,1702,1702,1208,1208,1208,1208,1208,1208,1001,1001,1104,1104,1208,1208,1702,1702,1702,1702,1702,1702]
print(len(list))
dist = {}
for i in list:
    if i in dist:
        dist[i] += 1
    else:
        dist[i] = 1
print(sorted(dist.items(), key=lambda item:item[1], reverse=True))

# 1	刑事
# 2	行政
# 3	民事
# 101	刑附民纠纷
# 102	行政纠纷
# 103	家事纠纷
# 104	物权纠纷
# 105	合同纠纷
# 106	侵权纠纷
# 107	劳动、人事争议纠纷
# 108	与公司、保险有关纠纷
# 109	人格权纠纷
# 110	知识产权纠纷
# 111	消费者权益纠纷
# 112	虚假陈述责任
# 113	证券期货纠纷
# 114	海事海商纠纷
# 999	其他
# 1001	婚姻家庭纠纷
# 1002	继承纠纷
# 1101	宅基地纠纷
# 1102	相邻关系纠纷
# 1103	业主权益纠纷
# 1104	其它物权纠纷
# 1201	买卖合同纠纷
# 1202	民间借贷纠纷
# 1203	借用合同纠纷
# 1204	租赁合同纠纷
# 1205	物业服务合同纠纷
# 1206	建设工程合同纠纷
# 1207	农业承包合同纠纷
# 1208	其他合同纠纷
# 1301	道交事故纠纷
# 1302	人身损害赔偿纠纷
# 1303	产品责任纠纷
# 1304	医患纠纷
# 1305	校园纠纷
# 1306	环境污染责任纠纷
# 1307	其他侵权纠纷
# 1401	劳动争议纠纷
# 1402	人事争议纠纷
# 1501	与公司有关纠纷
# 1502	与保险有关纠纷
# 1601	生命权、健康权、身体纠纷权
# 1602	其他人格权纠纷
# 1701	知识产权合同纠纷
# 1702	知识产权侵权纠纷
# 1801	消费者权益保护纠纷
# 1901	虚假陈述证券民事赔偿纠纷
# 1999	其他民事纠纷
# 2001	证券期货纠纷
# 2101	海事侵权纠纷
# 2102	海商合同纠纷
# 2103	其他海事海商纠纷